docs/CS/Regular_Expression.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-06-26 Mon 13:38 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="weiwu" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline2">1. Matching characters</a>
<ul>
<li><a href="#orgheadline1">1.1. metacharacters</a></li>
</ul>
</li>
<li><a href="#orgheadline4">2. Repeating Things</a>
<ul>
<li><a href="#orgheadline3">2.1. *.</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">1</span> Matching characters</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> metacharacters</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">. ^ $ * + ? { } <span style="color: #AE81FF;">[</span> <span style="color: #AE81FF;">]</span> \ | <span style="color: #AE81FF;">(</span> <span style="color: #AE81FF;">)</span>
</pre>
</div>
<ul class="org-ul">
<li>The first metacharacters we’ll look at are [ and ]. They’re used for specifying a character class, which is a set of characters that you wish to match. Characters can be listed individually, or a range of characters can be indicated by giving two characters and separating them by a '-'. For example, [abc] will match any of the characters a, b, or c; this is the same as [a-c], which uses a range to express the same set of characters. If you wanted to match only lowercase letters, your RE would be [a-z].</li>
<li>You can match the characters not listed within the class by complementing the set.
This is indicated by including a '^' as the first character of the class; '^' outside a character class will simply match the '^' character. For example, [<sup>5</sup>] will match any character except '5'.</li>
<li>\. As in Python string literals, the backslash can be followed by various characters to signal various special sequences. It’s also used to escape all the metacharacters so you can still match them in patterns; for example, if you need to match a [ or \, you can precede them with a backslash to remove their special meaning: \[ or \\.</li>
<li>\d</li>
</ul>
<p>
Matches any decimal digit; this is equivalent to the class [0-9].
</p>
<ul class="org-ul">
<li>\D</li>
</ul>
<p>
Matches any non-digit character; this is equivalent to the class [<sup>0</sup>-9].
</p>
<ul class="org-ul">
<li>\s</li>
</ul>
<p>
Matches any whitespace character; this is equivalent to the class [ \t\n\r\f\v].
</p>
<ul class="org-ul">
<li>&sect;</li>
</ul>
<p>
Matches any non-whitespace character; this is equivalent to the class [^ \t\n\r\f\v].
</p>
<ul class="org-ul">
<li>\w</li>
</ul>
<p>
Matches any alphanumeric character; this is equivalent to the class [a-zA-Z0-9_].
</p>
<ul class="org-ul">
<li>\W</li>
</ul>
<p>
Matches any non-alphanumeric character; this is equivalent to the class [<sup>a</sup>-zA-Z0-9_].
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">2</span> Repeating Things</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">2.1</span> *.</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>doesn’t match the literal character *; instead, it specifies that the previous character can be matched zero or more times, instead of exactly once.</li>
</ul>
<p>
For example, ca*t will match ct (0 a characters), cat (1 a), caaat (3 a characters), and so forth.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-06-23 Fri&gt;</span></span></p>
<p class="author">Author: weiwu</p>
<p class="date">Created: 2017-06-26 Mon 13:38</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
